Catalogs/Туры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Туры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Чемпионаты</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.Чемпионаты</xr:Item>
				<xr:Item>Catalog.Туры</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОлимпийскаяСистема</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/Матч.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>Матч</Name>
			<BasedOn>
				<xr:Item>Catalog.Стадионы</xr:Item>
				<xr:Item>Catalog.Команды</xr:Item>
				<xr:Item>Catalog.Туры</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТурнирнаяТаблица</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тур</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Туры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стадион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Стадионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗрителей</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЗрителей</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоГолов</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пенальти</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставыКоманд</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Игрок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Игроки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Туры/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура КодПриИзменении(Элемент=Неопределено)
	НаименованиеУстановить();
КонецПроцедуры

&НаСервере
Процедура НаименованиеУстановить()
	Если Объект.Ссылка.Пустая()
	Или ПустаяСтрока(Объект.Наименование)
	Тогда
		Объект.Наименование = РеквизитФормыВЗначение("Объект").НаименованиеПолучить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере(Отказ)
	Если Объект.Код = 0 Тогда
		Объект.Код = КодНовыйПолучить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Изображение	= СерверныйФункции.ИзображениеПолучить(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере(Отказ);
	Если Объект.Ссылка.Пустая() И ПустаяСтрока(Объект.Наименование) Тогда
		КодПриИзменении();
	КонецЕсли;
	ДоступностьВидимостьУстановить();
КонецПроцедуры

&НаСервере
Процедура ДоступностьВидимостьУстановить(Перечитать=Ложь)
	Если Перечитать Тогда
		Прочитать();
	КонецЕсли;
	
	Если ЕстьМатчи(Объект.Ссылка) Тогда
		Элементы.Владелец.ТолькоПросмотр					= Истина;
		//Элементы.ОлимпийскаяСистема.Доступность			= Ложь;
	Иначе
	КонецЕсли;
	Элементы.ОлимпийскаяСистема.Видимость = ВладелецОлимпийскаяСистема();
КонецПроцедуры

&НаСервере
Функция КодНовыйПолучить()
	Возврат РеквизитФормыВЗначение("Объект").КодНовыйПолучить();
КонецФункции

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	Объект.Код = КодНовыйПолучить();
	КодПриИзменении();
КонецПроцедуры

&НаСервере
Функция ЕстьМатчи(Тур)
	Если Тур.Пустая() Тогда Возврат Ложь; КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЕСТЬNULL(МАКСИМУМ(Матч.Дата), &Дата) КАК Дата
	                      |ИЗ
	                      |	Документ.Матч КАК Матч
	                      |ГДЕ
	                      |	Матч.Тур = &Тур");
	Запрос.УстановитьПараметр("Тур",	Тур);
	Запрос.УстановитьПараметр("Дата",	Дата(1, 1, 1));
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат (Выборка.Следующий() И Год(Выборка.Дата) > 1);
КонецФункции

&НаСервере
Функция ВладелецОлимпийскаяСистема()
	Возврат СерверныйФункции.ЛигаОлимпийскаяСистема(Объект.Владелец);
КонецФункции

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Объект.ДатаОкончания = Макс(Объект.ДатаОкончания, ?(ДеньНедели(Объект.ДатаНачала) = 7, Объект.ДатаНачала, Объект.ДатаНачала + Сутки()));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ТипЗнч(Параметр) = Тип("СправочникСсылка.Чемпионаты")
	И Параметр = Объект.Владелец
	Тогда
		Перечитать();
	ИначеЕсли СтрСравнить(ИмяСобытия, "Матчи") = 0 Тогда
		Перечитать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Перечитать() Экспорт
	Прочитать();
КонецПроцедуры

&НаСервере
Процедура КомандаДатыИсправитьНаСервере()
	РеквизитФормыВЗначение("Объект").ДатыУстановить(Объект);
КонецПроцедуры

&НаКлиенте
Процедура КомандаДатыИсправить(Команда)
	КомандаДатыИсправитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОлимпийскаяСистемаПриИзменении(Элемент)
	НаименованиеУстановить();
КонецПроцедуры

&НаКлиенте
Функция ПараметрыДиалога()
	Возврат НаКлиенте.ПараметрыДиалога();
КонецФункции

&НаКлиенте
Процедура ВыбратьИзображение(Команда)
	Если СтрСравнить(Команда.Имя, "ВыбратьИзображение") = 0 Тогда
		НачатьПомещениеФайлаНаСервер(Новый ОписаниеОповещения("ОбработатьВыборФайла", ЭтотОбъект),,,, ПараметрыДиалога());
	ИначеЕсли СтрСравнить(Команда.Имя, "УдалитьИзображение") = 0 Тогда
		Изображение = ИзображениеДефолтПолучить();
		Модифицированность	= Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИзображениеДефолтПолучить()
	Возврат НаСервереПовторно.ИзображениеДефолтПолучить();
КонецФункции

&НаКлиенте
Функция РазмерНорм(Размер)
	Возврат (Размер >= ОбщегоНазначения.РазмерКартинкиМинимальный());
КонецФункции

&НаКлиенте
Процедура ОбработатьВыборФайла(Результат, ДополнительныеПараметры=Неопределено) Экспорт
	Если ТипЗнч(Результат) = Тип("ОписаниеПомещенногоФайла") Тогда
		Если ОбщегоНазначения.РасширениеФайлаВерно(Результат.СсылкаНаФайл.Расширение)
		И РазмерНорм(Результат.СсылкаНаФайл.Размер())
		Тогда
			Изображение = Результат.Адрес;
		Иначе
			ОбщегоНазначения.СообщитьОбОшибке("Данный тип файла не поддерживается");
		КонецЕсли;
	ИначеЕсли ТипЗнч(Результат) = Тип("Строка") И НЕ ПустаяСтрока(Результат) Тогда
		ТекДанные				= Новый ДвоичныеДанные(Результат);
		Если РазмерНорм(ТекДанные.Размер()) Тогда
			Изображение			= ПоместитьВоВременноеХранилище(ТекДанные, УникальныйИдентификатор);
			Модифицированность	= Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзображениеПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	Если ЭтоУРЛ(ПараметрыПеретаскивания.Значение) Тогда
		НачатьКопированиеФайла(Новый ОписаниеОповещения("ОбработатьВыборФайла", ЭтотОбъект), ПараметрыПеретаскивания.Значение, СерверныйФункции.КаталогаФайлов() + ИмяФайла(ПараметрыПеретаскивания.Значение));
	ИначеЕсли ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("СсылкаНаФайл") Тогда
		Если ОбщегоНазначения.РасширениеФайлаВерно(ПараметрыПеретаскивания.Значение.Расширение) Тогда
			Изображение			= ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПараметрыПеретаскивания.Значение.Файл.ПолноеИмя), УникальныйИдентификатор);
			Модифицированность	= Истина;
			СтандартнаяОбработка= Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Модифицированность Тогда
		СерверныйФункции.ПередЗаписьюНаСервереИзображение(ТекущийОбъект, Изображение, Отказ);
	КонецЕсли;
КонецПроцедуры
